import Image from 'next/image';
import {Fragment, useState} from 'react';
import {useSwipeable} from 'react-swipeable';
import Breadcrumbs from '../../components/Breadcrumbs/Breadcrumbs';
import BuyTicket from '../../components/BuyTicket/BuyTicket';
import CardContainer from '../../components/CardContainer/CardContainer';
import Container from '../../components/Container/Container';
import ProductSlider from '../../components/ProductSlider/ProductSlider';
import styles from '../../styles/Product.module.scss';
import Viewed from '../../components/Viewed/Viewed';

const Product = () => {
	const [isExpandedText, setIsExpandedText] = useState(false);
	const [isVisibleHiddenPlaces, setIsVisibleHiddenPlaces] = useState(false);
	const [isVisibleHiddenEvents, setIsVisibleHiddenEvents] = useState(false);
	const [activeDiscount, setActiveDiscount] = useState(0);
//	const [isOpenFullText, setIsOpenFullText] = useState([false, false, false]);
	
	const places = [
		'Красная площадь',
		'Новый Арбат',
		'Храм Христа Спасителя',
		'Москва-сити',
		'Воробьевы горы',
		'Смотровая площадка',
		'Патриарший мост',
		'Красная площадь',
		'Новый Арбат',
		'Храм Христа Спасителя',
		'Москва-сити',
		'Воробьевы горы',
		'Смотровая площадка',
		'Патриарший мост',
	];
	
	const placesList = places.map((place, index) => {
		if (index === 7 && places.length - 1 > 7) {
			return (
				<Fragment key={index}>
					<li
						className={`
							${styles.Product__place}
							${styles.Product__place_more}
							${isVisibleHiddenPlaces ? styles.Product__place_hidden : ''}
						`}
					>
						<button onClick={() => setIsVisibleHiddenPlaces(true)}>И еще +{places.length - index} мест</button>
					</li>
					<li
						className={`${styles.Product__place} ${!isVisibleHiddenPlaces ? styles.Product__place_hidden : ''}`}
					>
						{place}
					</li>
				</Fragment>
			);
		} else {
			return (
				<li
					className={`
						${styles.Product__place}
						${(index > 7 && !isVisibleHiddenPlaces) ? styles.Product__place_hidden : ''}
					`}
					key={index}
				>
					{place}
				</li>
			);
		}
	});
	
	const events = [
		{
			title: '“Салют с борта теплохода на 9 мая',
			info: 'Рыбатекст используется дизайнерами, проектировщиками и фронтендерами, когда нужно быстро заполнить макеты.',
			date: '09 мая',
			time: '14:00 - 19:00',
		},
		{
			title: '“Салют с борта теплохода на 9 мая',
			info: 'Рыбатекст используется дизайнерами, проектировщиками и фронтендерами, когда нужно быстро заполнить макеты.',
			date: '09 мая',
			time: '14:00 - 19:00',
		},
		{
			title: '“Салют с борта теплохода на 9 мая',
			info: 'Рыбатекст используется дизайнерами, проектировщиками и фронтендерами, когда нужно быстро заполнить макеты.',
			date: '09 мая',
			time: '14:00 - 19:00',
		},
		{
			title: '“Салют с борта теплохода на 9 мая',
			info: 'Рыбатекст используется дизайнерами, проектировщиками и фронтендерами, когда нужно быстро заполнить макеты.',
			date: '09 мая',
			time: '14:00 - 19:00',
		},
		{
			title: '“Салют с борта теплохода на 9 мая',
			info: 'Рыбатекст используется дизайнерами, проектировщиками и фронтендерами, когда нужно быстро заполнить макеты.',
			date: '09 мая',
			time: '14:00 - 19:00',
		},
	];
	
	const eventsList = events.map((event, index) => {
		return (
			<div
				className={`${styles.Product__event} ${(index >= 2 && !isVisibleHiddenEvents) ? styles.Product__event_hidden : ''}`}
				key={index}
			>
				<header>
					<span>{event.title}</span>
					<i>
						<svg width="4" height="9" viewBox="0 0 4 9" fill="none" xmlns="http://www.w3.org/2000/svg">
							<circle cx="3" cy="1" r="1" fill="white"/>
							<path d="M2 3H4V9H2V5L0 3H2Z" fill="white"/>
						</svg>
					</i>
					<p className={styles.Product__paragraph_light}>{event.info}</p>
				</header>
				<div>
					<div>
						<h5>Доступная дата</h5>
						<span>{event.date}</span>
					</div>
					<div>
						<h5>Интервал события</h5>
						<span>{event.time}</span>
					</div>
				</div>
			</div>
		);
	});
	
	const discounts = [
		{
			title: 'Вернем до 20% от цены билета при оплате картой системой “МИР”',
			background: '/assets/images/discounts/discount-background-1.png',
			label: 'Покупайте с выгодой',
		},
		{
			title: 'Скидка 10% для первой поездки на любую экскурсию',
			background: '/assets/images/discounts/discount-background-2.png',
			label: '',
		},
	];
	
	const discountsList = discounts.map((discount, index) => (
		<div
			className={styles.Product__discount}
			style={{backgroundImage: `url(${discount.background})`}}
			key={index}
		>
			{discount.label && <i>{discount.label}</i>}
			<span>{discount.title}</span>
		</div>
	));
	
	const nextDiscount = () => {
		activeDiscount < discounts.length - 1 && setActiveDiscount(activeDiscount + 1);
	};
	
	const prevDiscount = () => {
		activeDiscount > 0 && setActiveDiscount(activeDiscount - 1);
	};
	
	const handlers = useSwipeable({
		onSwipedLeft: nextDiscount,
		onSwipedRight: prevDiscount,
	});
	
	return (
		<div className={styles.Product}>
			<ProductSlider/>
			<div className={styles.Product__container}>
				<Container>
					<Breadcrumbs/>
					<h1 className={styles.Product__title}>По москва-реке на теплоходе</h1>
					<ul className={styles.Product__info}>
						<li>вт 15 мар</li>
						<li>08:00 - 19:30</li>
						<li>6 причалов</li>
					</ul>
					<div className={styles.Product__description}>
						<CardContainer>
							<h2>О событии</h2>
							<div className={styles.Product__text}>
								<p className={styles.Product__paragraph}>Рыбатекст используется дизайнерами, проектировщиками и
								                                         фронтендерами, когда нужно быстро заполнить макеты. Рыбатекст
								                                         используется дизайнерами, проектировщиками и фронтендерами,
								                                         когда нужно быстро заполнить макеты.</p>
								<p className={`${styles.Product__paragraph} ${isExpandedText ? styles.Product__paragraph_active : ''}`}>
									Рыбатекст используется дизайнерами, проектировщиками и фронтендерами, когда нужно быстро заполнить
									макеты. Рыбатекст используется дизайнерами, проектировщиками и фронтендерами, когда нужно быстро
									заполнить макеты.
								</p>
							</div>
							<button className={styles.Product__button_expand} onClick={() => setIsExpandedText(!isExpandedText)}>
								{!isExpandedText ? 'Читать полностью' : 'Свернуть'}
							</button>
						</CardContainer>
						<CardContainer>
							<div className={styles.Product__survey}>
								<h4>Место встречи</h4>
								<span className={styles.Product__span}>Пресненская набережная, 2, причал №2</span>
								<h4>Продолжительность</h4>
								<span className={styles.Product__span}>1 час 30 минут</span>
								<h4>Возраст</h4>
								<span className={styles.Product__span}>8+</span>
								<h4>Туроператор</h4>
								<span className={styles.Product__span}>Нева Тревел</span>
								<h4>Возрастная категория</h4>
								<span className={styles.Product__span}>От 3х лет</span>
							</div>
						</CardContainer>
						<CardContainer>
							<h2>Транспорт</h2>
							<div className={styles.Product__illustration}>
								<Image
									src="/assets/images/product/product-image-1.png"
									width={340}
									height={300}
									layout="fill"
									objectFit="cover"
									alt=""
								/>
							</div>
							<div className={styles.Product__survey}>
								<h3>Теплоход</h3>
								<p className={styles.Product__paragraph_light}>Теплоходы с двумя палубами: нижней и верхней. На нижней
								                                               располагается закрытая часть и бар, на верхней - открытая
								                                               и закрытая части.</p>
								<h5>Удобства</h5>
								<span className={styles.Product__span_small}>Туалет, панорамные окна</span>
								<h5>Количества мест</h5>
								<span className={styles.Product__span_small}>72</span>
								<h5>Тип теплохода</h5>
								<span className={styles.Product__span_small}>Двухпалубный</span>
							</div>
						</CardContainer>
						<CardContainer>
							<h2>Список достопримечательностей</h2>
							<ul className={styles.Product__places}>
								{placesList}
							</ul>
						</CardContainer>
						<CardContainer>
							<h2>События</h2>
							<div className={styles.Product__events}>
								{eventsList}
								{(events.length > 2 && !isVisibleHiddenEvents) && (
									<button
										onClick={() => setIsVisibleHiddenEvents(true)}
									>
										И еще {events.length - 2} события
									</button>
								)}
							</div>
						</CardContainer>
						<CardContainer>
							<h2>Маршрут экскурсии</h2>
							<div className={styles.Product__map}>
								<Image
									src="/assets/images/product/product-map.png"
									width={294}
									height={244}
									layout="responsive"
									alt=""
								/>
							</div>
						</CardContainer>
					</div>
				</Container>
				<div className={styles.Product__discounts} {...handlers}>
					<div style={{transform: `translateX(calc(${-100 * activeDiscount}% - ${0.75 * activeDiscount}rem))`}}>
						{discountsList}
					</div>
				</div>
				<Container>
					<div className={styles.Product__description}>
						<BuyTicket/>
						<CardContainer>
							<div className={styles.Product__warning}>
								<header>
									<strong>Внимание!</strong>
									<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path d="M12 0C5.36705 0 0 5.36752 0 12C0 18.633 5.36752 24 12 24C18.633 24 24 18.6325 24 12C24 5.36705 18.6325 0 12 0ZM12 22.125C6.40345 22.125 1.875 17.5962 1.875 12C1.875 6.40345 6.40383 1.875 12 1.875C17.5965 1.875 22.125 6.40383 22.125 12C22.125 17.5965 17.5962 22.125 12 22.125Z" fill="#51ADF0"/>
										<path d="M12 6.04109C11.4822 6.04109 11.0625 6.46081 11.0625 6.97859V13.0158C11.0625 13.5335 11.4822 13.9533 12 13.9533C12.5178 13.9533 12.9375 13.5335 12.9375 13.0158V6.97859C12.9375 6.46081 12.5178 6.04109 12 6.04109Z" fill="#51ADF0"/>
										<path d="M12 17.6325C12.699 17.6325 13.2656 17.0658 13.2656 16.3668C13.2656 15.6679 12.699 15.1012 12 15.1012C11.301 15.1012 10.7344 15.6679 10.7344 16.3668C10.7344 17.0658 11.301 17.6325 12 17.6325Z" fill="#51ADF0"/>
									</svg>
									<p>Рыбатекст используется дизайнерами, проектировщиками и фронтендерами, когда нужно быстро заполнить
									   макеты.</p>
								</header>
								<span>Дети до 6-ти лет не допускаются на данный вид экскурсии.</span>
								<span>На экскурсию нельзя брать животных</span>
							</div>
						</CardContainer>
						<CardContainer>
							<div className={styles.Product__reviews}>
								<header>
									<h2>Отзывы</h2>
									<div>
										<span>Общая оценка</span>
										<span className={styles.Product__rating}>
											<svg width="65" height="13" viewBox="0 0 65 13" fill="none" xmlns="http://www.w3.org/2000/svg">
												<path d="M6.21468 0.878116C6.30449 0.601723 6.69551 0.601722 6.78532 0.878115L7.89199 4.28409C7.93215 4.4077 8.04734 4.49139 8.1773 4.49139H11.7586C12.0492 4.49139 12.17 4.86327 11.9349 5.03409L9.0376 7.13911C8.93245 7.2155 8.88846 7.35091 8.92862 7.47452L10.0353 10.8805C10.1251 11.1569 9.80875 11.3867 9.57364 11.2159L6.67634 9.1109C6.57119 9.0345 6.42881 9.0345 6.32366 9.1109L3.42637 11.2159C3.19125 11.3867 2.87491 11.1569 2.96471 10.8805L4.07138 7.47452C4.11154 7.35091 4.06755 7.2155 3.9624 7.13911L1.0651 5.03409C0.829989 4.86327 0.950821 4.49139 1.24144 4.49139H4.8227C4.95266 4.49139 5.06785 4.4077 5.10801 4.28409L6.21468 0.878116Z" fill="#F0515D"/>
												<path d="M19.2147 0.878116C19.3045 0.601723 19.6955 0.601722 19.7853 0.878115L20.892 4.28409C20.9321 4.4077 21.0473 4.49139 21.1773 4.49139H24.7586C25.0492 4.49139 25.17 4.86327 24.9349 5.03409L22.0376 7.13911C21.9325 7.2155 21.8885 7.35091 21.9286 7.47452L23.0353 10.8805C23.1251 11.1569 22.8087 11.3867 22.5736 11.2159L19.6763 9.1109C19.5712 9.0345 19.4288 9.0345 19.3237 9.1109L16.4264 11.2159C16.1913 11.3867 15.8749 11.1569 15.9647 10.8805L17.0714 7.47452C17.1115 7.35091 17.0675 7.2155 16.9624 7.13911L14.0651 5.03409C13.83 4.86327 13.9508 4.49139 14.2414 4.49139H17.8227C17.9527 4.49139 18.0679 4.4077 18.108 4.28409L19.2147 0.878116Z" fill="#F0515D"/>
												<path d="M32.2147 0.878116C32.3045 0.601723 32.6955 0.601722 32.7853 0.878115L33.892 4.28409C33.9321 4.4077 34.0473 4.49139 34.1773 4.49139H37.7586C38.0492 4.49139 38.17 4.86327 37.9349 5.03409L35.0376 7.13911C34.9325 7.2155 34.8885 7.35091 34.9286 7.47452L36.0353 10.8805C36.1251 11.1569 35.8087 11.3867 35.5736 11.2159L32.6763 9.1109C32.5712 9.0345 32.4288 9.0345 32.3237 9.1109L29.4264 11.2159C29.1913 11.3867 28.8749 11.1569 28.9647 10.8805L30.0714 7.47452C30.1115 7.35091 30.0675 7.2155 29.9624 7.13911L27.0651 5.03409C26.83 4.86327 26.9508 4.49139 27.2414 4.49139H30.8227C30.9527 4.49139 31.0679 4.4077 31.108 4.28409L32.2147 0.878116Z" fill="#F0515D"/>
												<path d="M45.2147 0.878116C45.3045 0.601723 45.6955 0.601722 45.7853 0.878115L46.892 4.28409C46.9321 4.4077 47.0473 4.49139 47.1773 4.49139H50.7586C51.0492 4.49139 51.17 4.86327 50.9349 5.03409L48.0376 7.13911C47.9325 7.2155 47.8885 7.35091 47.9286 7.47452L49.0353 10.8805C49.1251 11.1569 48.8087 11.3867 48.5736 11.2159L45.6763 9.1109C45.5712 9.0345 45.4288 9.0345 45.3237 9.1109L42.4264 11.2159C42.1913 11.3867 41.8749 11.1569 41.9647 10.8805L43.0714 7.47452C43.1115 7.35091 43.0675 7.2155 42.9624 7.13911L40.0651 5.03409C39.83 4.86327 39.9508 4.49139 40.2414 4.49139H43.8227C43.9527 4.49139 44.0679 4.4077 44.108 4.28409L45.2147 0.878116Z" fill="#F0515D"/>
												<path d="M58.2147 0.878116C58.3045 0.601723 58.6955 0.601722 58.7853 0.878115L59.892 4.28409C59.9321 4.4077 60.0473 4.49139 60.1773 4.49139H63.7586C64.0492 4.49139 64.17 4.86327 63.9349 5.03409L61.0376 7.13911C60.9325 7.2155 60.8885 7.35091 60.9286 7.47452L62.0353 10.8805C62.1251 11.1569 61.8087 11.3867 61.5736 11.2159L58.6763 9.1109C58.5712 9.0345 58.4288 9.0345 58.3237 9.1109L55.4264 11.2159C55.1913 11.3867 54.8749 11.1569 54.9647 10.8805L56.0714 7.47452C56.1115 7.35091 56.0675 7.2155 55.9624 7.13911L53.0651 5.03409C52.83 4.86327 52.9508 4.49139 53.2414 4.49139H56.8227C56.9527 4.49139 57.0679 4.4077 57.108 4.28409L58.2147 0.878116Z" fill="#F0515D"/>
												<path d="M58.4998 0.883924C58.4998 0.724495 58.7236 0.689037 58.7729 0.840662L59.8917 4.28409C59.9319 4.4077 60.0471 4.49139 60.1771 4.49139H63.7583C64.0489 4.49139 64.1698 4.86327 63.9347 5.03409L61.0374 7.13911C60.9322 7.2155 60.8882 7.35091 60.9284 7.47452L62.035 10.8805C62.1248 11.1569 61.8085 11.3867 61.5734 11.2159L58.6234 9.07263C58.5457 9.01618 58.4998 8.92595 58.4998 8.82992V0.883924Z" fill="#E0DEDA"/>
											</svg>
											<em>4.5</em>
										</span>
									</div>
								</header>
								<div className={styles.Product__review}>
									<header>
										<div>
											<Image src="/assets/images/reviews/review-image-1.png" width={36} height={36} alt=""/>
											<div>
												<span>Мария В.</span>
												<i>03 апреля 2022</i>
											</div>
										</div>
										<span className={styles.Product__rating}>
											<svg width="65" height="13" viewBox="0 0 65 13" fill="none" xmlns="http://www.w3.org/2000/svg">
												<path d="M6.21468 0.878116C6.30449 0.601723 6.69551 0.601722 6.78532 0.878115L7.89199 4.28409C7.93215 4.4077 8.04734 4.49139 8.1773 4.49139H11.7586C12.0492 4.49139 12.17 4.86327 11.9349 5.03409L9.0376 7.13911C8.93245 7.2155 8.88846 7.35091 8.92862 7.47452L10.0353 10.8805C10.1251 11.1569 9.80875 11.3867 9.57364 11.2159L6.67634 9.1109C6.57119 9.0345 6.42881 9.0345 6.32366 9.1109L3.42637 11.2159C3.19125 11.3867 2.87491 11.1569 2.96471 10.8805L4.07138 7.47452C4.11154 7.35091 4.06755 7.2155 3.9624 7.13911L1.0651 5.03409C0.829989 4.86327 0.950821 4.49139 1.24144 4.49139H4.8227C4.95266 4.49139 5.06785 4.4077 5.10801 4.28409L6.21468 0.878116Z" fill="#F0515D"/>
												<path d="M19.2147 0.878116C19.3045 0.601723 19.6955 0.601722 19.7853 0.878115L20.892 4.28409C20.9321 4.4077 21.0473 4.49139 21.1773 4.49139H24.7586C25.0492 4.49139 25.17 4.86327 24.9349 5.03409L22.0376 7.13911C21.9325 7.2155 21.8885 7.35091 21.9286 7.47452L23.0353 10.8805C23.1251 11.1569 22.8087 11.3867 22.5736 11.2159L19.6763 9.1109C19.5712 9.0345 19.4288 9.0345 19.3237 9.1109L16.4264 11.2159C16.1913 11.3867 15.8749 11.1569 15.9647 10.8805L17.0714 7.47452C17.1115 7.35091 17.0675 7.2155 16.9624 7.13911L14.0651 5.03409C13.83 4.86327 13.9508 4.49139 14.2414 4.49139H17.8227C17.9527 4.49139 18.0679 4.4077 18.108 4.28409L19.2147 0.878116Z" fill="#F0515D"/>
												<path d="M32.2147 0.878116C32.3045 0.601723 32.6955 0.601722 32.7853 0.878115L33.892 4.28409C33.9321 4.4077 34.0473 4.49139 34.1773 4.49139H37.7586C38.0492 4.49139 38.17 4.86327 37.9349 5.03409L35.0376 7.13911C34.9325 7.2155 34.8885 7.35091 34.9286 7.47452L36.0353 10.8805C36.1251 11.1569 35.8087 11.3867 35.5736 11.2159L32.6763 9.1109C32.5712 9.0345 32.4288 9.0345 32.3237 9.1109L29.4264 11.2159C29.1913 11.3867 28.8749 11.1569 28.9647 10.8805L30.0714 7.47452C30.1115 7.35091 30.0675 7.2155 29.9624 7.13911L27.0651 5.03409C26.83 4.86327 26.9508 4.49139 27.2414 4.49139H30.8227C30.9527 4.49139 31.0679 4.4077 31.108 4.28409L32.2147 0.878116Z" fill="#F0515D"/>
												<path d="M45.2147 0.878116C45.3045 0.601723 45.6955 0.601722 45.7853 0.878115L46.892 4.28409C46.9321 4.4077 47.0473 4.49139 47.1773 4.49139H50.7586C51.0492 4.49139 51.17 4.86327 50.9349 5.03409L48.0376 7.13911C47.9325 7.2155 47.8885 7.35091 47.9286 7.47452L49.0353 10.8805C49.1251 11.1569 48.8087 11.3867 48.5736 11.2159L45.6763 9.1109C45.5712 9.0345 45.4288 9.0345 45.3237 9.1109L42.4264 11.2159C42.1913 11.3867 41.8749 11.1569 41.9647 10.8805L43.0714 7.47452C43.1115 7.35091 43.0675 7.2155 42.9624 7.13911L40.0651 5.03409C39.83 4.86327 39.9508 4.49139 40.2414 4.49139H43.8227C43.9527 4.49139 44.0679 4.4077 44.108 4.28409L45.2147 0.878116Z" fill="#F0515D"/>
												<path d="M58.2147 0.878116C58.3045 0.601723 58.6955 0.601722 58.7853 0.878115L59.892 4.28409C59.9321 4.4077 60.0473 4.49139 60.1773 4.49139H63.7586C64.0492 4.49139 64.17 4.86327 63.9349 5.03409L61.0376 7.13911C60.9325 7.2155 60.8885 7.35091 60.9286 7.47452L62.0353 10.8805C62.1251 11.1569 61.8087 11.3867 61.5736 11.2159L58.6763 9.1109C58.5712 9.0345 58.4288 9.0345 58.3237 9.1109L55.4264 11.2159C55.1913 11.3867 54.8749 11.1569 54.9647 10.8805L56.0714 7.47452C56.1115 7.35091 56.0675 7.2155 55.9624 7.13911L53.0651 5.03409C52.83 4.86327 52.9508 4.49139 53.2414 4.49139H56.8227C56.9527 4.49139 57.0679 4.4077 57.108 4.28409L58.2147 0.878116Z" fill="#F0515D"/>
											</svg>
											<em>5.0</em>
										</span>
									</header>
									<p>Рыбатекст используется дизайнерами, проектировщиками и фронтендерами, когда нужно быстро заполнить макеты. Рыбатекст используется</p>
									<button>Читать далее</button>
								</div>
								<div className={styles.Product__review}>
									<header>
										<div>
											<Image src="/assets/images/reviews/review-image-2.png" width={36} height={36} alt=""/>
											<div>
												<span>Андрей С.</span>
												<i>01 апреля 2022</i>
											</div>
										</div>
										<span className={styles.Product__rating}>
											<svg width="65" height="13" viewBox="0 0 65 13" fill="none" xmlns="http://www.w3.org/2000/svg">
												<path d="M6.21468 0.878116C6.30449 0.601723 6.69551 0.601722 6.78532 0.878115L7.89199 4.28409C7.93215 4.4077 8.04734 4.49139 8.1773 4.49139H11.7586C12.0492 4.49139 12.17 4.86327 11.9349 5.03409L9.0376 7.13911C8.93245 7.2155 8.88846 7.35091 8.92862 7.47452L10.0353 10.8805C10.1251 11.1569 9.80875 11.3867 9.57364 11.2159L6.67634 9.1109C6.57119 9.0345 6.42881 9.0345 6.32366 9.1109L3.42637 11.2159C3.19125 11.3867 2.87491 11.1569 2.96471 10.8805L4.07138 7.47452C4.11154 7.35091 4.06755 7.2155 3.9624 7.13911L1.0651 5.03409C0.829989 4.86327 0.950821 4.49139 1.24144 4.49139H4.8227C4.95266 4.49139 5.06785 4.4077 5.10801 4.28409L6.21468 0.878116Z" fill="#F0515D"/>
												<path d="M19.2147 0.878116C19.3045 0.601723 19.6955 0.601722 19.7853 0.878115L20.892 4.28409C20.9321 4.4077 21.0473 4.49139 21.1773 4.49139H24.7586C25.0492 4.49139 25.17 4.86327 24.9349 5.03409L22.0376 7.13911C21.9325 7.2155 21.8885 7.35091 21.9286 7.47452L23.0353 10.8805C23.1251 11.1569 22.8087 11.3867 22.5736 11.2159L19.6763 9.1109C19.5712 9.0345 19.4288 9.0345 19.3237 9.1109L16.4264 11.2159C16.1913 11.3867 15.8749 11.1569 15.9647 10.8805L17.0714 7.47452C17.1115 7.35091 17.0675 7.2155 16.9624 7.13911L14.0651 5.03409C13.83 4.86327 13.9508 4.49139 14.2414 4.49139H17.8227C17.9527 4.49139 18.0679 4.4077 18.108 4.28409L19.2147 0.878116Z" fill="#F0515D"/>
												<path d="M32.2147 0.878116C32.3045 0.601723 32.6955 0.601722 32.7853 0.878115L33.892 4.28409C33.9321 4.4077 34.0473 4.49139 34.1773 4.49139H37.7586C38.0492 4.49139 38.17 4.86327 37.9349 5.03409L35.0376 7.13911C34.9325 7.2155 34.8885 7.35091 34.9286 7.47452L36.0353 10.8805C36.1251 11.1569 35.8087 11.3867 35.5736 11.2159L32.6763 9.1109C32.5712 9.0345 32.4288 9.0345 32.3237 9.1109L29.4264 11.2159C29.1913 11.3867 28.8749 11.1569 28.9647 10.8805L30.0714 7.47452C30.1115 7.35091 30.0675 7.2155 29.9624 7.13911L27.0651 5.03409C26.83 4.86327 26.9508 4.49139 27.2414 4.49139H30.8227C30.9527 4.49139 31.0679 4.4077 31.108 4.28409L32.2147 0.878116Z" fill="#F0515D"/>
												<path d="M45.2147 0.878116C45.3045 0.601723 45.6955 0.601722 45.7853 0.878115L46.892 4.28409C46.9321 4.4077 47.0473 4.49139 47.1773 4.49139H50.7586C51.0492 4.49139 51.17 4.86327 50.9349 5.03409L48.0376 7.13911C47.9325 7.2155 47.8885 7.35091 47.9286 7.47452L49.0353 10.8805C49.1251 11.1569 48.8087 11.3867 48.5736 11.2159L45.6763 9.1109C45.5712 9.0345 45.4288 9.0345 45.3237 9.1109L42.4264 11.2159C42.1913 11.3867 41.8749 11.1569 41.9647 10.8805L43.0714 7.47452C43.1115 7.35091 43.0675 7.2155 42.9624 7.13911L40.0651 5.03409C39.83 4.86327 39.9508 4.49139 40.2414 4.49139H43.8227C43.9527 4.49139 44.0679 4.4077 44.108 4.28409L45.2147 0.878116Z" fill="#F0515D"/>
												<path d="M58.2147 0.878116C58.3045 0.601723 58.6955 0.601722 58.7853 0.878115L59.892 4.28409C59.9321 4.4077 60.0473 4.49139 60.1773 4.49139H63.7586C64.0492 4.49139 64.17 4.86327 63.9349 5.03409L61.0376 7.13911C60.9325 7.2155 60.8885 7.35091 60.9286 7.47452L62.0353 10.8805C62.1251 11.1569 61.8087 11.3867 61.5736 11.2159L58.6763 9.1109C58.5712 9.0345 58.4288 9.0345 58.3237 9.1109L55.4264 11.2159C55.1913 11.3867 54.8749 11.1569 54.9647 10.8805L56.0714 7.47452C56.1115 7.35091 56.0675 7.2155 55.9624 7.13911L53.0651 5.03409C52.83 4.86327 52.9508 4.49139 53.2414 4.49139H56.8227C56.9527 4.49139 57.0679 4.4077 57.108 4.28409L58.2147 0.878116Z" fill="#E0DEDA"/>
											</svg>
											<em>4.0</em>
										</span>
									</header>
									<p>Рыбатекст используется дизайнерами, проектировщиками и фронтендерами, когда нужно быстро заполнить макеты. Рыбатекст используется</p>
								</div>
								<div className={styles.Product__review}>
									<header>
										<div>
											<i>A</i>
											<div>
												<span>Андрей С.</span>
												<i>01 апреля 2022</i>
											</div>
										</div>
										<span className={styles.Product__rating}>
											<svg width="65" height="13" viewBox="0 0 65 13" fill="none" xmlns="http://www.w3.org/2000/svg">
												<path d="M6.21468 0.878116C6.30449 0.601723 6.69551 0.601722 6.78532 0.878115L7.89199 4.28409C7.93215 4.4077 8.04734 4.49139 8.1773 4.49139H11.7586C12.0492 4.49139 12.17 4.86327 11.9349 5.03409L9.0376 7.13911C8.93245 7.2155 8.88846 7.35091 8.92862 7.47452L10.0353 10.8805C10.1251 11.1569 9.80875 11.3867 9.57364 11.2159L6.67634 9.1109C6.57119 9.0345 6.42881 9.0345 6.32366 9.1109L3.42637 11.2159C3.19125 11.3867 2.87491 11.1569 2.96471 10.8805L4.07138 7.47452C4.11154 7.35091 4.06755 7.2155 3.9624 7.13911L1.0651 5.03409C0.829989 4.86327 0.950821 4.49139 1.24144 4.49139H4.8227C4.95266 4.49139 5.06785 4.4077 5.10801 4.28409L6.21468 0.878116Z" fill="#F0515D"/>
												<path d="M19.2147 0.878116C19.3045 0.601723 19.6955 0.601722 19.7853 0.878115L20.892 4.28409C20.9321 4.4077 21.0473 4.49139 21.1773 4.49139H24.7586C25.0492 4.49139 25.17 4.86327 24.9349 5.03409L22.0376 7.13911C21.9325 7.2155 21.8885 7.35091 21.9286 7.47452L23.0353 10.8805C23.1251 11.1569 22.8087 11.3867 22.5736 11.2159L19.6763 9.1109C19.5712 9.0345 19.4288 9.0345 19.3237 9.1109L16.4264 11.2159C16.1913 11.3867 15.8749 11.1569 15.9647 10.8805L17.0714 7.47452C17.1115 7.35091 17.0675 7.2155 16.9624 7.13911L14.0651 5.03409C13.83 4.86327 13.9508 4.49139 14.2414 4.49139H17.8227C17.9527 4.49139 18.0679 4.4077 18.108 4.28409L19.2147 0.878116Z" fill="#F0515D"/>
												<path d="M32.2147 0.878116C32.3045 0.601723 32.6955 0.601722 32.7853 0.878115L33.892 4.28409C33.9321 4.4077 34.0473 4.49139 34.1773 4.49139H37.7586C38.0492 4.49139 38.17 4.86327 37.9349 5.03409L35.0376 7.13911C34.9325 7.2155 34.8885 7.35091 34.9286 7.47452L36.0353 10.8805C36.1251 11.1569 35.8087 11.3867 35.5736 11.2159L32.6763 9.1109C32.5712 9.0345 32.4288 9.0345 32.3237 9.1109L29.4264 11.2159C29.1913 11.3867 28.8749 11.1569 28.9647 10.8805L30.0714 7.47452C30.1115 7.35091 30.0675 7.2155 29.9624 7.13911L27.0651 5.03409C26.83 4.86327 26.9508 4.49139 27.2414 4.49139H30.8227C30.9527 4.49139 31.0679 4.4077 31.108 4.28409L32.2147 0.878116Z" fill="#F0515D"/>
												<path d="M45.2147 0.878116C45.3045 0.601723 45.6955 0.601722 45.7853 0.878115L46.892 4.28409C46.9321 4.4077 47.0473 4.49139 47.1773 4.49139H50.7586C51.0492 4.49139 51.17 4.86327 50.9349 5.03409L48.0376 7.13911C47.9325 7.2155 47.8885 7.35091 47.9286 7.47452L49.0353 10.8805C49.1251 11.1569 48.8087 11.3867 48.5736 11.2159L45.6763 9.1109C45.5712 9.0345 45.4288 9.0345 45.3237 9.1109L42.4264 11.2159C42.1913 11.3867 41.8749 11.1569 41.9647 10.8805L43.0714 7.47452C43.1115 7.35091 43.0675 7.2155 42.9624 7.13911L40.0651 5.03409C39.83 4.86327 39.9508 4.49139 40.2414 4.49139H43.8227C43.9527 4.49139 44.0679 4.4077 44.108 4.28409L45.2147 0.878116Z" fill="#F0515D"/>
												<path d="M58.2147 0.878116C58.3045 0.601723 58.6955 0.601722 58.7853 0.878115L59.892 4.28409C59.9321 4.4077 60.0473 4.49139 60.1773 4.49139H63.7586C64.0492 4.49139 64.17 4.86327 63.9349 5.03409L61.0376 7.13911C60.9325 7.2155 60.8885 7.35091 60.9286 7.47452L62.0353 10.8805C62.1251 11.1569 61.8087 11.3867 61.5736 11.2159L58.6763 9.1109C58.5712 9.0345 58.4288 9.0345 58.3237 9.1109L55.4264 11.2159C55.1913 11.3867 54.8749 11.1569 54.9647 10.8805L56.0714 7.47452C56.1115 7.35091 56.0675 7.2155 55.9624 7.13911L53.0651 5.03409C52.83 4.86327 52.9508 4.49139 53.2414 4.49139H56.8227C56.9527 4.49139 57.0679 4.4077 57.108 4.28409L58.2147 0.878116Z" fill="#E0DEDA"/>
											</svg>
											<em>4.0</em>
										</span>
									</header>
									<p>Рыбатекст используется дизайнерами, проектировщиками и фронтендерами, когда нужно быстро заполнить макеты. Рыбатекст используется</p>
								</div>
								<button>Смотреть все 53 отзыва</button>
							</div>
						</CardContainer>
					</div>
				</Container>
			</div>
			<Viewed/>
		</div>
	);
};

export default Product;
